package homework1;

public class Main {
    public static void main(String[] args) {
        String howIspentSummer
                = "На мой взгляд, лето – прекраснейшее время года, " +
                "поскольку очень тепло, вокруг все красиво, и у нас имеется " +
                "отличная возможность отдохнуть. А еще лето – это время каникул " +
                "и отпусков. Мы можем отправиться куда угодно, замечательно провести " +
                "время у водоема, в тени изумрудной зелени, плескаться в теплой воде. " +
                "А можно отправиться в горы, носиться на велосипеде или играть во " +
                "всевозможные игры. Я хочу поделиться впечатлениями от самого запоминающегося " +
                "момента за последние летние каникулы. В июле мы с моей семьей организовали " +
                "выезд в лес на шашлыки. Был разведен костер, приготовлено мясо для жарки, " +
                "и поставлена палатка. Пока мои родители готовили обед, я отправился в лес, " +
                "чтобы, как следует, нагулять аппетит. Лес в этот день был великолепен! " +
                "В воздухе стоял аромат цветов, меда и земляники. Все вокруг было зеленым, " +
                "только стволы деревьев яркими пятнами выделялись на темно-зеленом фоне. " +
                "Щебетали на своем языке птицы, стучал дятел. Вдруг послышались подозрительные " +
                "звуки... Мне показалось, что кто-то прошипел рядом со мной. Я обернулся " +
                "и увидел... извивающуюся змею! У меня тут же перехватило дыхание. Я даже " +
                "не запомнил, как она выглядела, поскольку сильно испугался. Я начал медленно " +
                "отступать, а затем ринулся к нашему лагерю. Я решил не рассказывать обо всем " +
                "случившемся маме, чтобы не волновать ее. Чуть позже, пообедав и вдоволь " +
                "повеселившись, мы собрали вещи и поехали домой. Да... Время летит очень быстро. " +
                "Жаль, что невозможно повторить те моменты и ощущения, которые были пережиты тобой " +
                "за время каникул. Но я верю, что следующее лето тоже будет незабываемым!\n" +
                "Источник: http://uchim.org/sochineniya/kak-ya-provel-leto";
        System.out.print(howIspentSummer);
    }
}
